
ACC: 1.74e+00 1.21e+00
Model: "sequential_10"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_20 (Dense)            (None, 1)                 2         
                                                                 
 activation_10 (Activation)  (None, 1)                 0         
                                                                 
 dense_21 (Dense)            (None, 1)                 2         
                                                                 
=================================================================
Total params: 4 (32.00 Byte)
Trainable params: 4 (32.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 1.31e+00 8.40e-01
Model: "sequential_11"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_22 (Dense)            (None, 2)                 4         
                                                                 
 activation_11 (Activation)  (None, 2)                 0         
                                                                 
 dense_23 (Dense)            (None, 1)                 3         
                                                                 
=================================================================
Total params: 7 (56.00 Byte)
Trainable params: 7 (56.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 1.11e+00 8.12e-01
Model: "sequential_12"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_24 (Dense)            (None, 3)                 6         
                                                                 
 activation_12 (Activation)  (None, 3)                 0         
                                                                 
 dense_25 (Dense)            (None, 1)                 4         
                                                                 
=================================================================
Total params: 10 (80.00 Byte)
Trainable params: 10 (80.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 8.90e-01 6.89e-01
Model: "sequential_13"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_26 (Dense)            (None, 4)                 8         
                                                                 
 activation_13 (Activation)  (None, 4)                 0         
                                                                 
 dense_27 (Dense)            (None, 1)                 5         
                                                                 
=================================================================
Total params: 13 (104.00 Byte)
Trainable params: 13 (104.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 7.71e-01 6.92e-01
Model: "sequential_14"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_28 (Dense)            (None, 5)                 10        
                                                                 
 activation_14 (Activation)  (None, 5)                 0         
                                                                 
 dense_29 (Dense)            (None, 1)                 6         
                                                                 
=================================================================
Total params: 16 (128.00 Byte)
Trainable params: 16 (128.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 6.44e-01 5.94e-01
Model: "sequential_15"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_30 (Dense)            (None, 6)                 12        
                                                                 
 activation_15 (Activation)  (None, 6)                 0         
                                                                 
 dense_31 (Dense)            (None, 1)                 7         
                                                                 
=================================================================
Total params: 19 (152.00 Byte)
Trainable params: 19 (152.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 7.47e-01 7.02e-01
Model: "sequential_16"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_32 (Dense)            (None, 7)                 14        
                                                                 
 activation_16 (Activation)  (None, 7)                 0         
                                                                 
 dense_33 (Dense)            (None, 1)                 8         
                                                                 
=================================================================
Total params: 22 (176.00 Byte)
Trainable params: 22 (176.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 7.24e-01 6.99e-01
Model: "sequential_17"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_34 (Dense)            (None, 8)                 16        
                                                                 
 activation_17 (Activation)  (None, 8)                 0         
                                                                 
 dense_35 (Dense)            (None, 1)                 9         
                                                                 
=================================================================
Total params: 25 (200.00 Byte)
Trainable params: 25 (200.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 5.62e-01 5.70e-01
Model: "sequential_18"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_36 (Dense)            (None, 9)                 18        
                                                                 
 activation_18 (Activation)  (None, 9)                 0         
                                                                 
 dense_37 (Dense)            (None, 1)                 10        
                                                                 
=================================================================
Total params: 28 (224.00 Byte)
Trainable params: 28 (224.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 5.99e-01 6.08e-01
Model: "sequential_19"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_38 (Dense)            (None, 10)                20        
                                                                 
 activation_19 (Activation)  (None, 10)                0         
                                                                 
 dense_39 (Dense)            (None, 1)                 11        
                                                                 
=================================================================
Total params: 31 (248.00 Byte)
Trainable params: 31 (248.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
