
ACC: 1.49e+00 9.48e-01
Model: "sequential_20"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_40 (Dense)            (None, 1)                 2         
                                                                 
 activation_20 (Activation)  (None, 1)                 0         
                                                                 
 dense_41 (Dense)            (None, 1)                 2         
                                                                 
=================================================================
Total params: 4 (32.00 Byte)
Trainable params: 4 (32.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 1.24e+00 8.16e-01
Model: "sequential_21"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_42 (Dense)            (None, 2)                 4         
                                                                 
 activation_21 (Activation)  (None, 2)                 0         
                                                                 
 dense_43 (Dense)            (None, 1)                 3         
                                                                 
=================================================================
Total params: 7 (56.00 Byte)
Trainable params: 7 (56.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 1.13e+00 8.24e-01
Model: "sequential_22"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_44 (Dense)            (None, 3)                 6         
                                                                 
 activation_22 (Activation)  (None, 3)                 0         
                                                                 
 dense_45 (Dense)            (None, 1)                 4         
                                                                 
=================================================================
Total params: 10 (80.00 Byte)
Trainable params: 10 (80.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 9.85e-01 8.03e-01
Model: "sequential_23"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_46 (Dense)            (None, 4)                 8         
                                                                 
 activation_23 (Activation)  (None, 4)                 0         
                                                                 
 dense_47 (Dense)            (None, 1)                 5         
                                                                 
=================================================================
Total params: 13 (104.00 Byte)
Trainable params: 13 (104.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 9.44e-01 7.92e-01
Model: "sequential_24"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_48 (Dense)            (None, 5)                 10        
                                                                 
 activation_24 (Activation)  (None, 5)                 0         
                                                                 
 dense_49 (Dense)            (None, 1)                 6         
                                                                 
=================================================================
Total params: 16 (128.00 Byte)
Trainable params: 16 (128.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 8.97e-01 7.83e-01
Model: "sequential_25"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_50 (Dense)            (None, 6)                 12        
                                                                 
 activation_25 (Activation)  (None, 6)                 0         
                                                                 
 dense_51 (Dense)            (None, 1)                 7         
                                                                 
=================================================================
Total params: 19 (152.00 Byte)
Trainable params: 19 (152.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 8.73e-01 7.77e-01
Model: "sequential_26"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_52 (Dense)            (None, 7)                 14        
                                                                 
 activation_26 (Activation)  (None, 7)                 0         
                                                                 
 dense_53 (Dense)            (None, 1)                 8         
                                                                 
=================================================================
Total params: 22 (176.00 Byte)
Trainable params: 22 (176.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 8.66e-01 7.75e-01
Model: "sequential_27"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_54 (Dense)            (None, 8)                 16        
                                                                 
 activation_27 (Activation)  (None, 8)                 0         
                                                                 
 dense_55 (Dense)            (None, 1)                 9         
                                                                 
=================================================================
Total params: 25 (200.00 Byte)
Trainable params: 25 (200.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 8.44e-01 7.71e-01
Model: "sequential_28"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_56 (Dense)            (None, 9)                 18        
                                                                 
 activation_28 (Activation)  (None, 9)                 0         
                                                                 
 dense_57 (Dense)            (None, 1)                 10        
                                                                 
=================================================================
Total params: 28 (224.00 Byte)
Trainable params: 28 (224.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

ACC: 8.29e-01 7.70e-01
Model: "sequential_29"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_58 (Dense)            (None, 10)                20        
                                                                 
 activation_29 (Activation)  (None, 10)                0         
                                                                 
 dense_59 (Dense)            (None, 1)                 11        
                                                                 
=================================================================
Total params: 31 (248.00 Byte)
Trainable params: 31 (248.00 Byte)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
